app/Models/Category.php

select * from `categories` where `cat_id` = '1' limit 1
---
    public static function getCategory_ById($category_id){

    return self:: where('category_id',$category_id)->first();